Detailed-Plan.html
<!doctype html>
<html lang="en">
<head>
<title></title>
<!-- 2023-07-23 Sun 18:58 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="Anton Hibl">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-3 col-md-push-9"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-1">1. Final Group Project Plan: Art Gallery Website</a>
<ul class="nav">
<li><a href="#sec-1-1">1.1. Team Members: Anton Hibl, Ethan Wilcox</a></li>
</ul>
</li>
</ul>
</div>
</nav>
</div><div class="col-md-9 col-md-pull-3"><h1 class="title"></h1>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Final Group Project Plan: Art Gallery Website</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Team Members: Anton Hibl, Ethan Wilcox</h3>
<div class="outline-text-3" id="text-1-1">
</div><div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> Introduction</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
This document provides an exhaustive, step-by-step plan for our Art Gallery
Website project, elaborating on our strategies and methods to bring the project
to life. By partitioning our project into two main phases, we aim to streamline
our progress while ensuring a thorough, complete, and high-quality result. 
</p>
</div>
</div>

<div id="outline-container-sec-1-1-2" class="outline-4">
<h4 id="sec-1-1-2"><span class="section-number-4">1.1.2</span> 1. Detailed List of React Components and their Interactions</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
To establish clarity and a systematic approach, we have divided our components
into two categories - "core" and "supportive". Our core components are integral
for the main functionality of our application, while the supportive components
enrich user interaction and assist in managing the data handling process. 
</p>

<ul class="org-ul">
<li>Core Components:

<ul class="org-ul">
<li>Home
</li>
<li>Gallery
</li>
<li>ArtworkDetail
</li>
<li>UserAccount
</li>
<li>Navbar
</li>
</ul>
</li>

<li>Supportive Components:

<ul class="org-ul">
<li>ArtworkCard
</li>
<li>Search
</li>
<li>LoginForm and RegisterForm
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-1-3" class="outline-4">
<h4 id="sec-1-1-3"><span class="section-number-4">1.1.3</span> 2. Functions and Application Logic</h4>
<div class="outline-text-4" id="text-1-1-3">
<p>
We have identified the core functions that will govern the primary operations of
our application: 
</p>

<ul class="org-ul">
<li>User registration and authentication: Functions like registerUser, loginUser,
logoutUser will handle user registration and authentication. They will
interact with the LoginForm and RegisterForm components and update the state
of UserAccount and Navbar components. 
</li>

<li>Artwork handling: Functions like uploadArtwork, searchArtwork will manage
artwork-related operations. They will coordinate with the UserAccount, Home,
Gallery, and Search components for various use-cases.
</li>

<li>User interactions: Functions like interactWithArtwork will handle user
interactions like liking, commenting, and sharing the artwork. They will
mainly interact with the ArtworkDetail component. 
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-1-4" class="outline-4">
<h4 id="sec-1-1-4"><span class="section-number-4">1.1.4</span> 3. API Request-Response Formats</h4>
<div class="outline-text-4" id="text-1-1-4">
<p>
Our application will maintain consistent interaction with the backend using the
following primary endpoints:
</p>

<ul class="org-ul">
<li>User Registration (POST /api/users)
</li>
<li>User Login (POST /api/users/login)
</li>
<li>Upload Artwork (POST /api/artworks)
</li>
<li>Search Artwork (GET /api/artworks/search)
</li>
<li>User Interactions (POST /api/interactions)
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-1-5" class="outline-4">
<h4 id="sec-1-1-5"><span class="section-number-4">1.1.5</span> 4. Endpoint Routes</h4>
<div class="outline-text-4" id="text-1-1-5">
<p>
Each of our API endpoint routes will serve a clear purpose and handle distinct
data operations. We have carefully selected and designed these routes to make
the process of data handling efficient, secure, and reliable. Each route and its
functionality, along with the expected data for each endpoint, have been
meticulously explained in our previous plan.
</p>
</div>
</div>

<div id="outline-container-sec-1-1-6" class="outline-4">
<h4 id="sec-1-1-6"><span class="section-number-4">1.1.6</span> 5. Design References</h4>
<div class="outline-text-4" id="text-1-1-6">
<p>
For the design of our Art Gallery Website, we are focusing on maintaining a
minimalist aesthetic while ensuring intuitive user navigation and high-quality
artwork showcase. Our design inspiration is drawn from established digital art
platforms and current web design trends to provide our users with a fresh,
contemporary, and enjoyable user experience. For each component and the overall
website design, we will create wireframes and mockups to provide a clear visual
guide during our development process.
</p>
</div>
</div>

<div id="outline-container-sec-1-1-7" class="outline-4">
<h4 id="sec-1-1-7"><span class="section-number-4">1.1.7</span> 6. Phase-1 and Phase-2 Deliverables</h4>
<div class="outline-text-4" id="text-1-1-7">
<p>
To ensure a manageable workload and efficient development process, we have
divided our project into two major phases. Each phase will focus on distinct
aspects of our project, allowing us to maintain an organized approach throughout
our development process.
</p>

<ul class="org-ul">
<li>Phase-1 Deliverables:
<ul class="org-ul">
<li>Project setup and environment preparation
</li>
<li>Design and implementation of the database schema
</li>
<li>Development of basic components and user registration/login functionalities
</li>
<li>Initial API endpoints for user registration and login
</li>
</ul>
</li>

<li>Phase-2 Deliverables:
<ul class="org-ul">
<li>Development of advanced components and functionalities
</li>
<li>Additional API endpoints to handle artwork upload, search, and user interactions
</li>
<li>Thorough testing, debugging, and deployment
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-1-8" class="outline-4">
<h4 id="sec-1-1-8"><span class="section-number-4">1.1.8</span> 7. Task Breakdown and Member Allocation</h4>
<div class="outline-text-4" id="text-1-1-8">
<p>
Our project task breakdown is primarily divided between frontend and backend
development tasks. The roles and tasks assigned to each team member ensure a
fair distribution of workload and an effective division of responsibilities
based on each member's strengths and areas of expertise.
</p>

<ul class="org-ul">
<li>Anton:

<ul class="org-ul">
<li>Phase-1 Tasks:
<ul class="org-ul">
<li>Environment Setup
</li>
<li>Home Component Development
</li>
<li>Navbar Component Development
</li>
<li>LoginForm and RegisterForm Component Development
</li>
<li>Design Wireframes and Mockups
</li>
</ul>
</li>

<li>Phase-2 Tasks:
<ul class="org-ul">
<li>Gallery Component Development
</li>
<li>ArtworkCard and ArtworkDetail Components Development
</li>
<li>UserAccount Component Development
</li>
<li>Testing and Debugging
</li>
</ul>
</li>
</ul>
</li>

<li>Ethan:

<ul class="org-ul">
<li>Phase-1 Tasks:
<ul class="org-ul">
<li>Project Initialization
</li>
<li>Database Schema Implementation
</li>
<li>User Registration and Login API Endpoints
</li>
<li>Initial Backend Testing
</li>
</ul>
</li>

<li>Phase-2 Tasks:
<ul class="org-ul">
<li>Artwork Upload and Search API Endpoints
</li>
<li>User Interaction API Endpoints
</li>
<li>Backend Optimization
</li>
<li>Final Backend Testing
</li>
</ul>
</li>
</ul>
</li>

<li>Collaborative Tasks:

<ul class="org-ul">
<li>Project Planning and Design
</li>
<li>Component Integration
</li>
<li>Project Review and Debugging
</li>
<li>Final Project Deployment
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-1-9" class="outline-4">
<h4 id="sec-1-1-9"><span class="section-number-4">1.1.9</span> Conclusion</h4>
<div class="outline-text-4" id="text-1-1-9">
<p>
In conclusion, this detailed plan and task breakdown ensure a systematic
approach to the project, efficient workload distribution, and effective
collaboration between team members. By adhering to this plan along with other
tools like our ER schema guidelines, we aim to deliver a high-quality, fully
functional Art Gallery Website within the allocated timeframe.
</p>
</div>
</div>
</div>
</div>
</div></div></div>
<footer id="postamble" class="">
<div><p class="author">Author: Anton Hibl</p>
<p class="date">Created: 2023-07-23 Sun 18:58</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 28.2 (<a href="http://orgmode.org">Org-mode</a> 9.5.5)</p>
</div>
</footer>
</body>
</html>
